app/controllers/movies_controller.rb

=begin
    if @checked_ratings == @all_ratings
      if @sort.nil?
        @movies = Movie.all
      else
        @movies = Movie.find(:all, :order => @sort)
      end
    elsif @checked_ratings == params[:ratings]
      if @sort.nil?
        @movies = Movie.find(:all, :conditions => {:rating => @checked_ratings.keys})
---
SELECT "movies".* FROM "movies" ORDER BY '--- !map:ActiveSupport::HashWithIndifferentAccess
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "PG"]]
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."PG-13" = '1' AND "rating"."R" = '1' AND "rating"."NC-17" = '1'